text1 = '🔸Я расскажу Вам о проекте, его доходности и способах активации. Нажмите интересующее Вас'

text2 = 'FairPact приветствует Вас в своем информационном боте.\n\
\n\
🤖 Меня зовут Джонни я отвечу на все Ваши вопросы и помогу разобраться в проекте 👣\n\
\n\
🔸Для начала посмотрите короткое видео о проекте  👇\n\
 в нем вы получите полное представление о том как работает проект, каковы доходности и условия.\n\
https://www.youtube.com/embed/2siTxb8CRUQ\n\
\n\
🔸Чтобы узнать больше, нажмите кнопку НАЧАТЬ 👇\n\
🔸Вы уже в команде проекта, нажмите кнопку ПАРТНЕРАМ👇 Остались вопросы, нажмите кнопку ПОМОЩЬ'

text3 = '🔹Вы готовы присоединиться к проекту и активировать смарт-контракт? Для этого надо проделать всего несколько шагов:\n\
\n\
1️⃣ ШАГ - установить кошелек\n\
2️⃣ ШАГ - купить Ethereum\n\
3️⃣ ШАГ - вызвать смарт-контракт\n\
\n\
🔹Выберите из меню ниже нужный шаг и получите детальную пошаговую инструкцию 👇\n\
\n\
- Установить\n\
ℹ️ Перед началом установки электронного кошелька для криптовалюты определитесь с типом устройства, с которым Вам будет легче работать. Для ПК и смартфона приложения различаются. Но каждое из них надежное и удобное, Выберите интересующее Вас'

text4 = 'Чтобы установить TRUS WALLET  на андроид::\n\
\n\
1️⃣ скачиваем приложение Trust Wallet в Google Play\n\
2️⃣ нажимаем "Создать новый кошелек"\n\
3️⃣ ставим ✅, нажимаем "Продолжить"\n\
4️⃣ нажимаем "Скопировать" и сохраняем мнемофразу (‼️ ВАЖНО: при создании ОБЯЗАТЕЛЬНО сохраняем фразу из 12 слов. НЕЛЬЗЯ терять или передавать фразу, ТОЛЬКО по ней можно восстановить доступ к кошельку‼️), далее нажимаем "Продолжить"\n\
\n\
Чтобы установить TOKEN POCKET НА IOS\n\
\n\
1️⃣ скачиваем приложение Token Pocket в AppStore(https://www.tokenpocket.pro/en/download/app)\n\
2️⃣ нажимаем "Создать новый кошелек"\n\
3️⃣ ставим ✅, нажимаем "Продолжить"\n\
4️⃣ нажимаем "Скопировать" и сохраняем мнемофразу (‼️ ВАЖНО: при создании ОБЯЗАТЕЛЬНО сохраняем фразу из 12 слов. НЕЛЬЗЯ терять или передавать фразу, ТОЛЬКО по ней можно восстановить доступ к кошельку‼️),\n\
5️⃣ Вводим 2 раза пароль (должен состоять из 8 символов, один из них в верхнем регистре) далее "Продолжить"\n\
'

text5 = 'Для покупки криптовалюты Ethereum необходимо:\n\
1️⃣  Перейти  на https://www.bestchange.ru/\n\
СЛЕВА на зеленом фоне\n\
а) в колонке "Отдаете" выбираем картой какого банка или какой платежной системой хотим произвести оплату (к примеру, Сбербанк)\n\
б) в колонке "Получите" выбираем Ethereum (ETH)\n\
\n\
2️⃣ Найти лучший по цене, отзывам и лимитам обменник (обычно указывается сверху)\n\
СПРАВА на белом фоне\n\
A) выбираем самую НИЗКУЮ цену для покупки\n\
Б) выбираем лимит от какой суммы вам могут совершить обмен и нажимаем на обменник\n\
\n\
3️⃣ Для входа в смарт контракт нужно всего 0,2 эфира, но сам блокчейн берет небольшую комиссию за перевод, поэтому покупаем немного больше (0,3 ETH) (сумму стоит уточнить у администратора проекта)\n\
\n\
1️⃣ снова выбираем с чего делаем перевод (я выбрал Сбербанк)\n\
2️⃣ выбираем Ethereum\n\
3️⃣ ставим Сумму в эфирах 0,3 можно и больше сразу купить, лишним сейчас эфир не будет (сумма в рублях ставится автоматом по курсу обменника)\n\
4️⃣ вводим свой адрес кошелька ETH, который копировали ранее в TrustWallet, по типу 0xFB7a029f24....\n\
5️⃣ вводим номер телефона\n\
6️⃣ вводим почту\n\
7️⃣ нажимаем "Начать обмен"\n\
\n\
👉 На этом этапе некоторые обменники могут требовать небольшую верификацию личности, либо подтверждения карты. В этом случае\n\
\n\
1️⃣ вводим номер карты с которой будем совершать обмен\n\
2️⃣ вводим данные владельца карты\n\
3️⃣ нажимаем "Отправить данные плательщика"\n\
4️⃣ после перевода средств нажимаем "Я оплатил"\n\
\n\
5️⃣ Оплата произведена\n\
Через 5-10 минут необходимое количество ETH будет на Вашем кошельке\n\
\n\
‼️ P.S. При обратном переводе ETH на рубли/доллары и т.д. необходимо проделать ту же процедуру.'


text6 = 'ℹ️ В зависимости от устройства, на котором установлен кошелек, процедура вызова смарт-контракта может быть различной 👇'

text7 = ' - На ПК (Metamask)  https://telegra.ph/Instrukciya-08-18-5\n\
Чтобы активировать  смарт-контракт через METAMASK\n\
\n\
✅ В адресную строку браузера вставьте реферальную ссылку https://fairpact.ru/ref/1688/\n\
✅ Нажмите на кнопку “Зарегистрироваться”\n\
✅ Во всплывающем окне MetaMask подтвердите оплату в 0.2 ЕТН\n\
✅ Вас перебросит на страницу Эзерскана с информацией о статусе вашей транзакции\n\
✅ Через пару минут Вас вернет на главную страницу https://fairpact.ru/, где вы сможете войти в кабинет\n\
✅ Перейдите к следующему шагу'


text8 = '- На телефоне (Android, IOS) https://telegra.ph/Instrukciya-08-16-4\n\
Для активации смарт-контракт на смартфоне\n\
\n\
✅ Заходите в TrustWallet \n\
✅ Переходим на Dapps (вкладка внизу)\n\
✅ В адресную строку браузера вставьте/ реферальную ссылку https://fairpact.ru/ref/1688/\n\
✅  Нажмите на кнопку “Зарегистрироваться”\n\
✅ Подтверждение одобрение на списание 0.2 ЕТН\n\
✅ Ждем несколько минут и\n\
✅ переходим на следующий шаг'

text9 = 'Смарт-контракт - программа, работающая на блокчейне. Его идея в том, чтобы создать доверительные договоры, сделки и протоколы.\n\
Участники сделки могут не беспокоиться о правильности выполнения обязательств с другой стороны, поскольку если условия не будут соблюдены, то контракт аннулируется с обоих сторон.\n\
\n\
Смарт - контракт  устраняет необходимость в посредниках, тем самым снижая лишние расходы.'


text10 = 'Что такое «блокчейн»?\n\
Блокчейн - непрерывная цепочка блоков, где содержится любая информация о договорах или сделках.\n\
Там прописаны все условия договора, и ежесекундно обновляется информация. Если деньги куда-то уходят и их становится меньше, всё это отражается в системе.\n\
\n\
Преимущество блокчейна в том, что он никогда не выйдет из строя. Он рассчитан на большое количество компьютеров и систем, поэтому информация никуда не пропадает. \n\
\n\
Также данные договора изменить нельзя. Взломать сделку и присвоить себе чужую собственность невозможно. Удалить участников нельзя, можно только добавить новых.\n\
\n\
Можно проследить всю историю передач из рук в руки и найти владельца.\n\
\n\
Лишние затраты на минимуме. Посредников нет. Их заменяют майнеры. Среди них высокая конкуренция, потому комиссии не такие высокие.\n\
\n\
Сделки полностью конфиденциальны. Другой человек, не имеющий отношения к договору, будет видеть только номер кошелька.\n\
'

text11 = 'Можно ли тут зарабатывать пассивно?\n\
\n\
Помимо личных приглашений, партнеры могут оказаться в Вашей структуре двумя способами. Это – “Переливы” и “Рефералы”.\n\
\n\
Поэтому можно утверждать, что в системе есть пассивный заработок. Но это не гарантирует Вам быстрого достойного дохода, которым могут похвастаться другие успешные участники, проявляющие активность.\n\
\n\
\n\
Что такое "Переливы"?\n\
\n\
Перелив – это процесс, который возникает при регистрации участника к аплайну, у которого заполнен первый уровень двумя участниками. Следующий новый участник попадает в структуру этого аплайна ниже, в ближайшее свободное место.\n\
\n\
Пример: Ваш аплайн 1-й линии (Ваш пригласитель в Систему) пригласил 2-х партнеров и продолжил приглашать дальше. Его 3-й партнер “переливом” прикрепляется к его личному партнеру – к тому, кто был первый зарегистрирован.\n\
\n\
Если и у Вас в структуре уже заполнены УЧАСТНИКАМИ несколько линий, то новые регистрации ТАКЖЕ “переливом” спускаются еще ниже и прикрепляются к Вашим свободным партнерам, становясь И Вашими партнерами нижних линий.\n\
Что такое уровни?\n\
\n\
Уровень – это статус, дающий право получать вознаграждение от партнера в своей структуре соответствующих линий.\n\
\n\
Пример:\n\
\n\
1-й уровень дает Вам право продать этот 1-й уровень двум лично приглашенным партнерам.\n\
2-й уровень дает Вам право продать этот 2-й уровень четырем Вашим партнерам второй линии.\n\
3-й уровень дает Вам право продать этот 3-й уровень восьмерым Вашим партнерам третьей линии.\n\
4-й уровень дает Вам право продать этот 4-й уровень шестнадцати Вашим партнерам четвертой линии.\n\
\n\
\n\
Если у меня 1 уровень, можно ли купить сразу 3-й уровень, не имея 2-й?\n\
\n\
Уровни покупаются только последовательно и по порядку. Если вы попытаетесь купить 3-й уровень, не имея 2-й, то смарт-контракт не обработает такой перевод. Деньги никуда не уйдут и останутся у Вас.\n\
\n\
\n\
Что произойдет, если мой партнер купит уровень раньше меня?\n\
\n\
Деньги будут переадресованы Вашему аплайну такой же линии, с какой и Ваш партнер.\n\
\n\
Если вовремя покупать уровни, этого не произойдет. Если же это произошло – не страшно. Если Вы это вовремя обнаружили, то после активации уровня продолжите получать оставшиеся переводы за этот уровень.\n\
\n\
Но, согласно нашей стратегии, мы прокупаем уровни синхронно рядами. Самовольная покупка уровня грозит вам потерей возможной прибыли и перерасходом средств. Поэтому очень важно Вам присоединиться к нашему командному чату в Telegram, чтобы ничего не пропустить\n\
\n\
Для чего нужно продлевать уровни каждые 45 дней?\n\
\n\
Благодаря этому правилу Ваша прибыль будет повторяться каждые 45 дней, так как после Вашего продления партнеры в Вашей структуре будут делать то же самое.\n\
\n\
Важно то, что каждый Ваш партнер, который не продлит по каким-либо причинам свой уровень, не лишит Вас прибыли, а, наоборот, увеличит её. Переводы, адресованные такому участнику за неоплаченный уровень, будут перенаправлены по структуре выше, в том числе и вам.\n\
\n\
Например, если Ваш партнер 4-й линии не продлил 4-й уровень, то все 16 переводов с его 4-й линии будут перенаправлены Вам (если у Вас этот уровень активен). Итого, Вы получите не 16, а 31 перевод за 4-й уровень.\n\
\n\
И чем больше в Вашей структуре выбывших партнеров, тем в разы больше Ваш доход.\n\
\n\
Где я могу получить больше информации о проекте?\n\
\n\
Вы можете задать вопросы непосредственно участникам, которые уже освоились в проекте и готовы поделиться своим опытом и успехами. Также можете узнать больше информации в PDF презентации маркетинга либо на нашем Telegram канале.\n\
Кновки внутри бота (PDF-презентация, Телеграмм канал, Сайт)' \
         'PDF https://te.legra.ph/FairPact-instrukciya-i-marketing-05-08\n\
канал телеграмм https://t.me/fairpact_official\n\
сайт   https://fairpact.ru/'


text12 = 'FairPact - проект, основанный на смарт-контракте.\n\
Задача - привлечение инвесторов в продвижение и развитие.\n\
Здесь есть возможность зарабатывать пассивно и активно, войдя в проект сотрудниками по копирайтингу, менеджменту и многое другое.\n\
Автоматические начисления, полная безопасность и анонимность сделок, пассивный заработок - это всё про нас.\n\
5.О смарт контракте \n\
Смарт-контракт - программа, работающая на блокчейне. Его идея в том, чтобы создать доверительные договоры, сделки и протоколы.\n\
Участники сделки могут не беспокоиться о правильности выполнения обязательств с другой стороны, поскольку если условия не будут соблюдены, то контракт аннулируется с обоих сторон.'


text13 = 'Как многие знают в нашем проекте можно зарабатывать по мимо маркетинга.\n\
А именно через личные приглашения, друзей и знакомых🤝\n\
Мы разработали и доработали систему вознаграждения за лично-приглашенных партнеров💰 Они намного интереснее и выгоднее, для каждого участника😉\n\
За КАЖДОГО лично приглашенного партнера вы получаете минимум 15% от суммы входа, а не 10% как это прописано в самом смарт-контракте С КАЖДОГО активированного по ОБЩЕЙ ссылке аккаунта. Даже за одного🔥'

text14 = '15% Если вы пригласили партнера или партнеров и они активировали до 30 аккаунтов, ваша выплата составит 15% от суммы их входа в 0.2 эфира. Например, ваши знакомые активировали 20 аккаунтов, ваша выплата из банка составит 0.6 эфира или 180$ по текущему курсу.'

text15 = '20%.Если вы пригласили партнера или партнеров и они активировали от 30 до 40 аккаунтов, ваша выплата ' \
         'составит 20% от суммы их входа в 0.2 эфира. Например, ваши знакомые активировали 40 аккаунтов, ваша выплата из банка составит 1.6 эфира или 500$ по текущему курсу.'

text16 = '25% Если вы пригласили партнера или партнеров и они активировали от 40 до 50 аккаунтов, ваша выплата составит 25% от суммы их входа в 0.2 эфира. Например, ваши знакомые активировали 50 аккаунтов, ваша выплата из банка составит 3.5 эфира или 800$ по текущему курсу.\n\
(Примечание, в данном варианте 20% выплачивается сразу, остальные 5% после поднятия уровней партнерами)'


text17 = '30% Если вы пригласили партнера или партнеров и они активировали от 50 аккаунтов, ваша выплата составит 30% от суммы их входа в 0.2 эфира. Например, ваши знакомые активировали 60 аккаунтов, ваша выплата из банка составит 3.6 эфира или 1150$ по текущему курсу.\n\
(Примечание, в данном варианте 20% выплачивается сразу, остальные 10% после поднятия уровней партнерами)'


text18 = 'Это человек, который загрузил код контракта в блокчейн криптовалюты Ethereum. С тех пор смарт-контракт является частью общей сети, которая поддерживается майнерами.Никто не вправе повлиять на работу смарт контракта, удалить его или остановить. Любая попытка внесения несанкционированных изменений будет отклонена из-за несоответствия предыдущим копиям в цепочке блоков.'

text19 = 'Мы видим свою миссию в предоставление каждому желающему возможности заработка на надежных и передовых проектах в режиме онлайн в долгосрочной перспективе.\n\
Наша цель - создание уникальной краудфандинговой кампании, использующей современные технологии и инновационные идеи и построенной на принципах качественного отбора проектов, честности, прозрачности, доступности любому желающему.'

text20 = 'FairPact -  Уникальная формула для тех, кто предпочитает инвестиции с низким уровнем риска.\n\
Forsage- ПЕРВЫЙ В ИСТОРИИ 100% ДЕЦЕНТРАЛИЗОВАННЫЙ\n\
Международная краудфандинговаяплатформа нового поколенияДецентрализованный маркетинг обеспечивает революционная технология умных контрактов*.Код смарт-контракта проекта Forsage полностью открыт, поэтому вы можете быть полностьюуверены в безопасности и долгосрочной работе проекта'

text21 = 'Работать и строить свою карьеру в компании WERCA выгодно с разных сторон. \n\
Мы предоставляем нашим сотрудникам право выбора: работать по узкой специальности или исполнять несколько ролей; учиться у профессионалов или же самим стать примером для подражания, тренером и коучем. Наши сотрудники расширяют свой кругозор и приобретают полезные знакомства в различных сферах деятельности.\n\
Хорошая площадка для профессионалов и тех, кто только начинает свою карьеру в новом направлении. Предлагаем не только теоретические, но и практические знания в онлайн сфере под руководством опытных наставников, а также возможность формирования своего портфолио для стремительного старта карьеры в других компаниях.'

text22 = 'YouTube    https://www.youtube.com/channel/UCaA6zOyTizERpDujH9QMi9g?view_as=subscriber\n\
Tik Tok      https://www.tiktok.com/@werca2020\n\
Facebook   https://www.facebook.com/login/?next=https%3A%2F%2Fwww.facebook.com%2Fgroups%2Ffairpact\n\
VK https://vk.com/fairpact2020\n\
Instagram https://www.instagram.com/werca.ru/?igshid=1co3q0eh1iwu2'

text23 = 'ℹ️ Перед началом установки электронного кошелька для криптовалюты определитесь с типом устройства, с которым Вам будет легче работать. Для ПК и смартфона приложения различаются. Но каждое из них надежное и удобное, Выберите интересующее Вас 👇'

text24 = '🔹Можно ли в проекте зарабатывать пассивно ❓\n\
👉 Да, можно.\n\
🔸В нашей ветке новые партнеры, привлеченные как слаженной работой команды, так и активными участниками, расставляются поочередно сверху вниз, слева направо. Поэтому наличие рефералов под Вами возможно и без Вашего активного участия. \n\
❗️Однако, если Вы все же будете активно приглашать друзей и родных в проект, Вы быстрее и больше заработаете (см. Бонусную программу)\n\
🔹Что такое "Переливы"❓\n\
🔸Переливом называется процесс, который возникает, когда новый участник регистрируется в структуру партнера, у которого уже заполнен первый уровень двумя участниками. Новый участник попадает в эту структуру на ближайшее свободное место ниже.\n\
🔹Что такое уровни ❓\n\
🔸Уровень – это статус, дающий право получать вознаграждение от своего партнера в соответствующей линии.\n\
👉 Например:\n\
1-й уровень дает Вам право продать этот 1-й уровень двум партнерам сразу под Вами.\n\
2-й уровень дает Вам право продать этот 2-й уровень четырем Вашим партнерам второй линии (под партнерами 1-ой линии)\n\
3-й уровень дает Вам право продать этот 3-й уровень восьмерым Вашим партнерам третьей линии.\n\
4-й уровень дает Вам право продать этот 4-й уровень шестнадцати Вашим партнерам четвертой линии.\n\
🔹Могу ли я сразу купить 3-й уровень, если у меня пока еще 1-й ❓\n\
🔸 Нет. Смарт-контракт не обработает такой перевод. Уровни покупаются только последовательно и по порядку.\n\
🔹А если мой партнер купит уровень раньше меня ❓\n\
🔸 Тогда деньги будут переадресованы партнеру выше. Но если это все же произошло, активируйте быстрее свой уровень и продолжайте получать оставшиеся переливы.\n\
❗️Мы подумали, как избежать подобной ситуации, и, согласно нашей стратегии, мы покупаем уровни синхронно целыми рядами. Поэтому очень важно присоединиться к нашему командному чату в Telegram, чтобы ничего не пропустить. Для присоединения зайдите в раздел КОНТАКТЫ\n\
🔹Почему нужно продлевать уровни каждые 45 дней ❓\n\
🔸 Чтобы Ваша прибыль повторялась каждые 45 дней.\n\
❗️Важно. Каждый Ваш партнер, который не продлит по каким-либо причинам свой уровень, не лишит Вас прибыли.  В этом случае те переводы, которые должны были быть адресованы ему, будут направлены по структуре выше, в том числе и вам.\n\
👉 Например, Ваш партнер 4-й линии не продлил 4-й уровень, и все 16 переводов с его 4-й линии будут перенаправлены Вам, если у 4-й уровень будет активен).\n\
🔹Где я могу получить больше информации о проекте ❓\n\
🔸 Все очень просто. Задавайте вопросы опытным участникам в наших соцсетях и в основном Telegram канале, смотрите нас в Ютуб канале  и скачивайте PDF презентацию.\n\
Как проходит покупка следующего уровня?\n\
Интересует, как проходит повторная покупка уровней ❓\n\
🔹 Вот инструкция '\
'Если вы не нашли информацию, которую искали,'\
                        ' можете пройти по ссылкам и поискать ее там\n\
                        @FairPact\n\
                        https://werca.site/buxdlqmskycy\n\
                        Пдф позже'